stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_rcc.h
#define LL_RCC_DIRECT_HSE_DIV_1             0x00000000U                                      /*!< DIRECT HSE division factor = 1   */
#define LL_RCC_DIRECT_HSE_DIV_2             RCC_CFGR_CLKSYSDIV_0                             /*!< DIRECT HSE division factor = 2   */
#define LL_RCC_DIRECT_HSE_DIV_3             RCC_CFGR_CLKSYSDIV_1                             /*!< DIRECT HSE division factor = 3   */
#define LL_RCC_DIRECT_HSE_DIV_6             (RCC_CFGR_CLKSYSDIV_1 | RCC_CFGR_CLKSYSDIV_0)    /*!< DIRECT HSE division factor = 6   */
#define LL_RCC_DIRECT_HSE_DIV_12            RCC_CFGR_CLKSYSDIV_2                             /*!< DIRECT HSE division factor = 12  */
#define LL_RCC_DIRECT_HSE_DIV_24            (RCC_CFGR_CLKSYSDIV_2 | RCC_CFGR_CLKSYSDIV_0)    /*!< DIRECT HSE division factor = 24  */
#define LL_RCC_DIRECT_HSE_DIV_48            (RCC_CFGR_CLKSYSDIV_2 | RCC_CFGR_CLKSYSDIV_1)    /*!< DIRECT HSE division factor = 48  */

/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_DIV  RC64MPLL divider factor to have the System clock
  * @{
  */
#define LL_RCC_RC64MPLL_DIV_1                0x00000000U                                     /*!< RC64MPLL not divided as SYSCLK   */
#define LL_RCC_RC64MPLL_DIV_2                RCC_CFGR_CLKSYSDIV_0                            /*!< RC64MPLL divided by 2 as SYSCLK  */
#define LL_RCC_RC64MPLL_DIV_4                RCC_CFGR_CLKSYSDIV_1                            /*!< RC64MPLL divided by 4 as SYSCLK  */
#define LL_RCC_RC64MPLL_DIV_8                (RCC_CFGR_CLKSYSDIV_1 | RCC_CFGR_CLKSYSDIV_0)   /*!< RC64MPLL divided by 8 as SYSCLK  */
#define LL_RCC_RC64MPLL_DIV_16               RCC_CFGR_CLKSYSDIV_2                            /*!< RC64MPLL divided by 16 as SYSCLK */
#define LL_RCC_RC64MPLL_DIV_32               (RCC_CFGR_CLKSYSDIV_2 | RCC_CFGR_CLKSYSDIV_0)   /*!< RC64MPLL divided by 32 as SYSCLK */
#define LL_RCC_RC64MPLL_DIV_64               (RCC_CFGR_CLKSYSDIV_2 | RCC_CFGR_CLKSYSDIV_1)   /*!< RC64MPLL divided by 64 as SYSCLK */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_SWITCH_DIV  RC64MPLL divider factor to switch the System clock with MR_BLE  or MR_SUBG enabled
  * @{
  */
#define LL_RCC_RC64MPLL_SWITCH_DIV_1                0x00000000U                              /*!< RC64MPLL not divided as SYSCLK   */
#define LL_RCC_RC64MPLL_SWITCH_DIV_2                RCC_CSCMDR_CLKSYSDIV_REQ_0               /*!< RC64MPLL divided by 2 as SYSCLK  */
#define LL_RCC_RC64MPLL_SWITCH_DIV_4                RCC_CSCMDR_CLKSYSDIV_REQ_1               /*!< RC64MPLL divided by 4 as SYSCLK  */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SYSCLK_SWITCH_STATUS  Status of the RC64MPLL clock switch  with MR_BLE or MR_SUBG enabled
  * @{
  */
#define LL_RCC_RC64MPLL_SWITCH_STATUS_IDLE          0x00000000U                              /*!< RC64MPLL Clock Switch Status IDLE    */
#define LL_RCC_RC64MPLL_SWITCH_STATUS_ONGOING       RCC_CSCMDR_STATUS_0                      /*!< RC64MPLL Clock Switch Status ONGOING */
#define LL_RCC_RC64MPLL_SWITCH_STATUS_DONE          RCC_CSCMDR_STATUS_1                      /*!< RC64MPLL Clock Switch Status DONE    */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCOSOURCE  MCO SOURCE selection
  * @{
  */
#define LL_RCC_MCOSOURCE_NOCLOCK          0x00000000U                                   /*!< MCO output disabled, no clock on MCO */
#define LL_RCC_MCOSOURCE_SYSCLK           RCC_CFGR_MCOSEL_0                             /*!< SYSCLK selection as MCO source */
#define LL_RCC_MCOSOURCE_HSI              (RCC_CFGR_MCOSEL_0|RCC_CFGR_MCOSEL_1)         /*!< HSI selection as MCO source */
#define LL_RCC_MCOSOURCE_RC64MPLL         (RCC_CFGR_MCOSEL_0|RCC_CFGR_MCOSEL_1)         /*!< RC64MPLL selection as MCO source */
#define LL_RCC_MCOSOURCE_HSE              RCC_CFGR_MCOSEL_2                             /*!< HSE after stabilization selection as MCO source */
#define LL_RCC_MCOSOURCE_HSI64M_DIV2048   (RCC_CFGR_MCOSEL_0|RCC_CFGR_MCOSEL_2)         /*!< HSI_64M divided by 2048 seelction as MCO source */
#define LL_RCC_MCOSOURCE_SMPS             (RCC_CFGR_MCOSEL_1|RCC_CFGR_MCOSEL_2)         /*!< SMPS selection as MCO source */
#define LL_RCC_MCOSOURCE_ADC              RCC_CFGR_MCOSEL                               /*!< ADC selection as MCO source */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_MCO_DIV  MCO prescaler
  * @{
  */
#define LL_RCC_MCO_DIV_1                  0x00000000U                                   /*!< MCO not divided */
#define LL_RCC_MCO_DIV_2                  RCC_CFGR_CCOPRE_0                             /*!< MCO divided by 2 */
#define LL_RCC_MCO_DIV_4                  RCC_CFGR_CCOPRE_1                             /*!< MCO divided by 4 */
#define LL_RCC_MCO_DIV_8                  (RCC_CFGR_CCOPRE_1 | RCC_CFGR_CCOPRE_0)       /*!< MCO divided by 8 */
#define LL_RCC_MCO_DIV_16                 RCC_CFGR_CCOPRE_2                             /*!< MCO divided by 16 */
#define LL_RCC_MCO_DIV_32                 (RCC_CFGR_CCOPRE_2 | RCC_CFGR_CCOPRE_0)       /*!< MCO divided by 32 */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_LSCOSOURCE  LCO SOURCE selection
  * @{
  */
#define LL_RCC_LSCOSOURCE_NOCLOCK          0x00000000U                                   /*!< LSCO output disabled, no clock on LSCO          */
#define LL_RCC_LSCOSOURCE_LSI              RCC_CFGR_LCOSEL_1                             /*!< LSI selection as LSCO source                   */
#define LL_RCC_LSCOSOURCE_LSE              (RCC_CFGR_LCOSEL_0|RCC_CFGR_LCOSEL_1)         /*!< LSE selection as LSCO source                   */
/**
  * @}
  */

/** @defgroup RCC_LL_EC_SMPS_DIV  SMPS prescaler
  * @{
  */
#define LL_RCC_SMPS_DIV_2                  (0x00000000U)                                 /*!< SMPS clock division 2 (SMPS clock is 8 MHz)*/
#define LL_RCC_SMPS_DIV_4                  RCC_CFGR_SMPSDIV                              /*!< SMPS clock division 4 (SMPS clock is 4 MHz)*/
/**
  * @}
  */

#if defined(RCC_CFGR_LPUCLKSEL)
/** @defgroup RCC_LL_CFGR_LPU_CLK  LPUART clock selection
  * @{
  */
#define LL_RCC_LPUCLKSEL_CLK16M                  (0x00000000U)                             /*!< LPUART Clock Selection 16 MHz     */
#define LL_RCC_LPUCLKSEL_CLKLSE                  RCC_CFGR_LPUCLKSEL                        /*!< LPUART Clock Selection LSE source */
/**
  * @}
  */
#endif /*RCC_CFGR_LPUCLKSEL*/

#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EC_PERIPH_FREQUENCY Peripheral clock frequency
  * @{
  */
#define LL_RCC_PERIPH_FREQUENCY_NO         0x00000000U                 /*!< No clock enabled for the peripheral            */
#define LL_RCC_PERIPH_FREQUENCY_NA         0xFFFFFFFFU                 /*!< Frequency cannot be provided as external clock */
/**
  * @}
  */
#endif /* USE_FULL_LL_DRIVER */

/** @defgroup RCC_LL_EC_SPI3_I2S SPI3_I2S
  * @{
  */
#define LL_RCC_SPI3_I2S_CLKSOURCE_CLK_ROOT_DIV          0x00000000U              /*!< SPI3 I2S 16 MHz clock source selection bits */
#if !defined(RCC_CFGR_SPI3I2SCLKSEL_0)
#define LL_RCC_SPI3_I2S_CLKSOURCE_CLK_ROOT              RCC_CFGR_SPI3I2SCLKSEL   /*!< SPI3 I2S 32 MHz clock source selection bits */
#endif
#if defined(RCC_CFGR_SPI3I2SCLKSEL_0)
#define LL_RCC_SPI3_I2S_CLKSOURCE_CLK_ROOT              RCC_CFGR_SPI3I2SCLKSEL_0   /*!< SPI3 I2S 24/32 MHz clock source selection bits */
#define LL_RCC_SPI3_I2S_CLKSOURCE_CLK_RC64MPLL          RCC_CFGR_SPI3I2SCLKSEL_1   /*!< SPI3 I2S 64 MHz clock source selection bits */
#endif

/**
  * @}
  */


