stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_rcc.h
#if defined(SPI3)
#define LL_RCC_SPI3_CLKSOURCE           0x00000000U               /*!< SPI3 clock source */
#endif

#if defined(RCC_CFGR_LPUCLKSEL)
/** @defgroup RCC_LL_EC_LPUART1 LPUART1
  * @{
  */
#define LL_RCC_LPUART1_CLKSOURCE           0x00000000U               /*!< LPUART1 clock source */
/**
  * @}
  */
#endif /* RCC_CFGR_LPUCLKSEL */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup RCC_LL_Exported_Macros RCC Exported Macros
  * @{
  */

/** @defgroup RCC_LL_EM_WRITE_READ Common Write and read registers Macros
  * @{
  */

/**
  * @brief  Write a value in RCC register
  * @param  __REG__ Register to be written
  * @param  __VALUE__ Value to be written in the register
  * @retval None
  */
#define LL_RCC_WriteReg(__REG__, __VALUE__) WRITE_REG(RCC->__REG__, (__VALUE__))

/**
  * @brief  Read a value in RCC register
  * @param  __REG__ Register to be read
  * @retval Register value
  */
#define LL_RCC_ReadReg(__REG__) READ_REG(RCC->__REG__)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/

/** @defgroup RCC_LL_Exported_Functions RCC Exported Functions
  * @{
  */

/** @defgroup RCC_LL_EF_HSE HSE
  * @{
  */

/**
  * @brief  Enable HSE crystal oscillator (HSE ON)
  * @rmtoll CR           HSEON         LL_RCC_HSE_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSEON);
}

/**
  * @brief  Disable HSE crystal oscillator (HSE ON)
  * @rmtoll CR           HSEON         LL_RCC_HSE_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSEON);
}

/**
  * @brief  Check if HSE crystal oscillator is enabled.
  * @rmtoll CR         HSEON        LL_RCC_HSE_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSEON) == (RCC_CR_HSEON)) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSE oscillator Ready
  * @rmtoll CR           HSERDY        LL_RCC_HSE_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSERDY) == (RCC_CR_HSERDY)) ? 1UL : 0UL);
}

/**
  * @brief  Set HSE capacitor tuning
  * @rmtoll RFSWHSECR        SWXOTUNE       LL_RCC_HSE_SetCapacitorTuning
  * @param  Value Between Min_Data = 0 and Max_Data = 63
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSE_SetCapacitorTuning(uint32_t Value)
{
  MODIFY_REG(RCC->RFSWHSECR, RCC_RFSWHSECR_SWXOTUNE, Value << RCC_RFSWHSECR_SWXOTUNE_Pos);
  SET_BIT(RCC->RFSWHSECR, RCC_RFSWHSECR_SWXOTUNEEN);
}

/**
  * @brief  Get HSE capacitor tuning
  * @rmtoll RFSWHSECR        SWXOTUNE      LL_RCC_HSE_GetCapacitorTuning
  * @retval Between Min_Data = 0 and Max_Data = 63
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_GetCapacitorTuning(void)
{
  return (uint32_t)(READ_BIT(RCC->RFSWHSECR, RCC_RFSWHSECR_SWXOTUNE) >> RCC_RFSWHSECR_SWXOTUNE_Pos);
}


/**
  * @brief  Set HSE current control. The Current is calculated with the following
  *         formula: Iref * GMC[4:0].
  *         Iref(GMC[6:5])--> 00= 10uA
  *         Iref(GMC[6:5])--> 01= 20uA
  *         Iref(GMC[6:5])--> 1x= 40uA
  *         Example GMC[6:0]=0b1111001=25*40uA
  * @rmtoll RFSWHSECR        GMC       LL_RCC_HSE_SetCurrentControl
  * @param  CurrentMax HSE current calculated with the previous formula
  */
__STATIC_INLINE void LL_RCC_HSE_SetCurrentControl(uint32_t CurrentMax)
{
  MODIFY_REG_FIELD(RCC->RFSWHSECR, RCC_RFSWHSECR_GMC, CurrentMax);
}

/**
  * @brief  Get HSE current control
  * @rmtoll RFSWHSECR       GMC       LL_RCC_HSE_GetCurrentControl
  * @retval Returned HSE current control
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_GetCurrentControl(void)
{
  return (uint32_t)(READ_REG_FIELD(RCC->RFSWHSECR, RCC_RFSWHSECR_GMC));
}

#if defined(RCC_RFSWHSECR_SATRG)
/**
  * @brief  Set HSE sense amplifier threshold
  * @rmtoll RFSWHSECR        SATRG       LL_RCC_HSE_SetSenseAmplifier
  * @param  SenseAmplifier This parameter can be one of the following values:
  *         @arg @ref LL_RCC_HSEAMPTHRESHOLD_1_2
  *         @arg @ref LL_RCC_HSEAMPTHRESHOLD_3_4
  */
__STATIC_INLINE void LL_RCC_HSE_SetSenseAmplifier(uint32_t SenseAmplifier)
{
  MODIFY_REG(RCC->RFSWHSECR, RCC_RFSWHSECR_SATRG, SenseAmplifier);
}

/**
  * @brief  Get HSE current control
  * @rmtoll RFSWHSECR        SATRG       LL_RCC_HSE_GetSenseAmplifier
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_HSEAMPTHRESHOLD_1_2
  *         @arg @ref LL_RCC_HSEAMPTHRESHOLD_3_4
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_GetSenseAmplifier(void)
{
  return (uint32_t)(READ_BIT(RCC->RFSWHSECR, RCC_RFSWHSECR_SATRG));
}
#endif

#if defined(RCC_RFSWHSECR_ISTARTUP)
/**
  * @brief  Set HSE startup current
  * @rmtoll RFSWHSECR        ISTARTUP      LL_RCC_HSE_SetStartupCurrent
  * @param  StartupCurrent HSE startup current
  */
__STATIC_INLINE void LL_RCC_HSE_SetStartupCurrent(uint32_t StartupCurrent)
{
  MODIFY_REG_FIELD(RCC->RFSWHSECR, RCC_RFSWHSECR_ISTARTUP, StartupCurrent);
}

/**
  * @brief  Get HSE startup current
  * @rmtoll RFSWHSECR        ISTARTUP       LL_RCC_HSE_GetStartupCurrent
  * @retval Startup Current value
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_GetStartupCurrent(void)
{
  return (uint32_t)(READ_REG_FIELD(RCC->RFSWHSECR, RCC_RFSWHSECR_ISTARTUP));
}
#endif
#if defined(RCC_RFSWHSECR_AMPLTHRESH)
/**
  * @brief  Set HSE Amplitude Control threshold
  * @rmtoll RFSWHSECR        AMPLTHRESH      LL_RCC_HSE_SetAmplitudeThreshold
  * @param  AmplThr HSE Amplitude Control threshold
  */
__STATIC_INLINE void LL_RCC_HSE_SetAmplitudeThreshold(uint32_t AmplThr)
{
  MODIFY_REG_FIELD(RCC->RFSWHSECR, RCC_RFSWHSECR_AMPLTHRESH, AmplThr);
}

/**
  * @brief  Get HSE Amplitude Control threshold
  * @rmtoll RFSWHSECR        AMPLTHRESH       LL_RCC_HSE_GetAmplitudeThreshold
  * @retval HSE Amplitude Control threshold
  */
__STATIC_INLINE uint32_t LL_RCC_HSE_GetAmplitudeThreshold(void)
{
  return (uint32_t)(READ_REG_FIELD(RCC->RFSWHSECR, RCC_RFSWHSECR_AMPLTHRESH));
}
#endif
/**
  * @}
  */

/** @defgroup RCC_LL_EF_HSI HSI
  * @{
  */

/**
  * @brief  Enable HSI
  * @rmtoll CFGR           STOPHSI        LL_RCC_HSI_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_Enable(void)
{
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPHSI);
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_HSESEL);
}

/**
  * @brief  Disable HSI
  * @rmtoll CFGR           STOPHSI        LL_RCC_HSI_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_Disable(void)
{
  SET_BIT(RCC->CFGR, RCC_CFGR_HSESEL);
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPHSI);
}

/**
  * @brief  Check if HSI clock is ready
  * @rmtoll CR           HSIRDY        LL_RCC_HSI_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSIRDY) == (RCC_CR_HSIRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Set HSI Calibration trimming
  * @note user-programmable trimming value
  * @note Default value is loaded by HW at reset as soon as the flash controller achieves the reading of the
  *       information in Flash memory (reg. ICSCR).
  * @rmtoll CSSWCR        HSITRIM       LL_RCC_HSI_SetCalibTrimming
  * @param  Value Between Min_Data = 0 and Max_Data = 127
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSI_SetCalibTrimming(uint32_t Value)
{
  MODIFY_REG(RCC->CSSWCR, RCC_CSSWCR_HSITRIMSW, Value << RCC_CSSWCR_HSITRIMSW_Pos);
  SET_BIT(RCC->CSSWCR, RCC_CSSWCR_HSISWTRIMEN);
}

/**
  * @brief  Get HSI Calibration trimming
  * @rmtoll ICSCR/CSSWCR        HSITRIM       LL_RCC_HSI_GetCalibTrimming
  * @retval Between Min_Data = 0 and Max_Data = 127
  */
__STATIC_INLINE uint32_t LL_RCC_HSI_GetCalibTrimming(void)
{
  if ((uint32_t)(READ_BIT(RCC->CSSWCR, RCC_CSSWCR_HSISWTRIMEN)))
  {
    return (uint32_t)(READ_BIT(RCC->CSSWCR, RCC_CSSWCR_HSITRIMSW) >> RCC_CSSWCR_HSITRIMSW_Pos);
  }
  else
  {
    return (uint32_t)(READ_BIT(RCC->ICSCR, RCC_ICSCR_HSITRIM) >> RCC_ICSCR_HSITRIM_Pos);
  }
}
/**
  * @}
  */

/** @defgroup RCC_LL_EF_DIRECT_HSE DIRECT_HSE
  * @{
  */
/**
  * @brief  Enable DIRECT_HSE mode
  * @rmtoll CFGR       HSESEL/STOPHSI         LL_RCC_HSE_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DIRECT_HSE_Enable(void)
{
  while (READ_BIT(RCC->CR, RCC_CR_HSERDY) == 0);
  SET_BIT(RCC->CFGR, RCC_CFGR_HSESEL);
  for (volatile int i = 0; i < 6; i++)
  {
    __asm("NOP");
  }
  SET_BIT(RCC->CFGR, RCC_CFGR_STOPHSI);
}

/**
  * @brief  Disable DIRECT_HSE
  * @rmtoll CFGR       HSESEL/STOPHSI         LL_RCC_HSE_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DIRECT_HSE_Disable(void)
{
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_STOPHSI);
  while (LL_RCC_HSI_IsReady() == 0);
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_HSESEL);
}

/**
  * @brief  Check if DIRECT_HSE mode is ready
  * @rmtoll CFGR           HSESEL/STOPHSI  LL_RCC_DIRECT_HSE_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_DIRECT_HSE_IsEnabled(void)
{
#if defined(RCC_CFGR_HSESEL_STATUS)
  return ((READ_BIT(RCC->CFGR, RCC_CFGR_HSESEL_STATUS) == (RCC_CFGR_HSESEL_STATUS)) ? 1UL : 0UL);
#else
  return (((READ_BIT(RCC->CFGR, RCC_CFGR_HSESEL) == (RCC_CFGR_HSESEL)) && (READ_BIT(RCC->CFGR, RCC_CFGR_STOPHSI) == (RCC_CFGR_STOPHSI))) ? 1UL : 0UL);
#endif
}

#if defined(RCC_CFGR_HSESEL_STATUS)
/**
  * @brief  Get the DIRECT HSE Selection Status
  * @rmtoll CFGR         HSESEL_STATUS     LL_RCC_Get_DIRECT_HSESEL_Status
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_Get_DIRECT_HSESEL_Status(void)
{
  return ((READ_BIT(RCC->CFGR, RCC_CFGR_HSESEL_STATUS) == (RCC_CFGR_HSESEL_STATUS)) ? 1UL : 0UL);
}
#endif

/**
  * @}
  */

