stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_rcc.h
/** @defgroup RCC_LL_EF_LOCKDET_NSTOP LOCKDET_NSTOP
  * @{
  */

/**
  * @brief  Set LOCKDET_NSTOP time
  * @rmtoll CR       LOCKDET_NSTOP          LL_RCC_LOCKDET_NSTOP_SetTime
  * @param  time This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_0
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_1
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_2
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_3
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_4
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_5
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_6
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_7
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LOCKDET_NSTOP_SetTime(uint32_t time)
{
  MODIFY_REG(RCC->CR, RCC_CR_LOCKDET_NSTOP, time);
}

/**
  * @brief  Get RC64MPLL prescaler
  * @rmtoll CR         LOCKDET_NSTOP     LL_RCC_LOCKDET_NSTOP_GetTime
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_0
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_1
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_2
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_3
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_4
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_5
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_6
  *         @arg @ref LL_RCC_LOCKDET_NSTOP_7
  */
__STATIC_INLINE uint32_t LL_RCC_LOCKDET_NSTOP_GetTime(void)
{
  return (uint32_t)(READ_BIT(RCC->CR, RCC_CR_LOCKDET_NSTOP));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_LSCO LSCO
  * @{
  */

/**
  * @brief  Configure Low speed clock selection
  * @rmtoll CFGR         CLKSLOWSEL       LL_RCC_LSCO_SetSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_HSI64M_DIV2048
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSCO_SetSource(uint32_t Source)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_CLKSLOWSEL, Source);
}

/**
  * @brief  Get Low speed clock selection
  * @rmtoll CFGR         CLKSLOWSEL       LL_RCC_LSCO_GetSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSE
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_LSI
  *         @arg @ref LL_RCC_LSCO_CLKSOURCE_HSI64M_DIV2048
  */
__STATIC_INLINE uint32_t LL_RCC_LSCO_GetSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_CLKSLOWSEL));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_LSE LSE
  * @{
  */

/**
  * @brief  Enable  Low Speed External (LSE) crystal.
  * @rmtoll CR         LSEON         LL_RCC_LSE_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_LSEON);
}

/**
  * @brief  Disable  Low Speed External (LSE) crystal.
  * @rmtoll CR         LSEON         LL_RCC_LSE_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_LSEON);
}

/**
  * @brief  Check if Low Speed External (LSE) crystal has been enabled or not
  * @rmtoll CR         LSEON         LL_RCC_LSE_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_LSEON) == (RCC_CR_LSEON)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSE oscillator Ready
  * @rmtoll CR         LSERDY        LL_RCC_LSE_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_LSERDY) == (RCC_CR_LSERDY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable external clock source (LSE bypass).
  * @rmtoll CR         LSEBYP        LL_RCC_LSE_EnableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_EnableBypass(void)
{
  SET_BIT(RCC->CR, RCC_CR_LSEBYP);
}

/**
  * @brief  Disable external clock source (LSE bypass).
  * @rmtoll CR         LSEBYP        LL_RCC_LSE_DisableBypass
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_DisableBypass(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_LSEBYP);
}

/**
  * @brief  Check if LSE bypass configuration is enabled.
  * @rmtoll CR         LSEBYP        LL_RCC_LSE_IsBypassEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_IsBypassEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_LSEBYP) == (RCC_CR_LSEBYP)) ? 1UL : 0UL);
}

/**
  * @brief  Set LSE oscillator drive capability
  * @note The oscillator is in Xtal mode when it is not in bypass mode.
  * @rmtoll CSSWCR         LSEDRV        LL_RCC_LSE_SetDriveCapability
  * @param  LSEDrive This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSEDRIVE_LOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMLOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMHIGH
  *         @arg @ref LL_RCC_LSEDRIVE_HIGH
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSE_SetDriveCapability(uint32_t LSEDrive)
{
  MODIFY_REG(RCC->CSSWCR, RCC_CSSWCR_LSEDRV, LSEDrive);
}

/**
  * @brief  Get LSE oscillator drive capability
  * @rmtoll CSSWCR         LSEDRV        LL_RCC_LSE_GetDriveCapability
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LSEDRIVE_LOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMLOW
  *         @arg @ref LL_RCC_LSEDRIVE_MEDIUMHIGH
  *         @arg @ref LL_RCC_LSEDRIVE_HIGH
  */
__STATIC_INLINE uint32_t LL_RCC_LSE_GetDriveCapability(void)
{
  return (uint32_t)(READ_BIT(RCC->CSSWCR, RCC_CSSWCR_LSEDRV));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_LSI LSI
  * @{
  */

/**
  * @brief  Enable LSI Oscillator
  * @rmtoll CR          LSION         LL_RCC_LSI_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_LSION);
}

/**
  * @brief  Disable LSI Oscillator
  * @rmtoll CR          LSION         LL_RCC_LSI_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_LSION);
}

/**
  * @brief  Check if LSI crystal oscillator is enabled.
  * @rmtoll CR         LSION        LL_RCC_LSI_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_LSION) == (RCC_CR_LSION)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSI is Ready
  * @rmtoll CR          LSIRDY        LL_RCC_LSI_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_LSIRDY) == (RCC_CR_LSIRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Enable LSI trimming procedure
  * @rmtoll ICSCR          LSITRIMEN         LL_RCC_LSI_EnableTrimming
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_EnableTrimming(void)
{
  SET_BIT(RCC->ICSCR, RCC_ICSCR_LSITRIMEN);
}

/**
  * @brief  Disable LSI trimming procedure
  * @rmtoll ICSCR          LSITRIMEN         LL_RCC_LSI_DisableTrimming
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_DisableTrimming(void)
{
  CLEAR_BIT(RCC->ICSCR, RCC_ICSCR_LSITRIMEN);
}

/**
  * @brief  Check if LSI trimming procedure is enabled
  * @rmtoll ICSCR          LSITRIMEN        LL_RCC_LSI_IsTrimmingEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsTrimmingEnabled(void)
{
  return ((READ_BIT(RCC->ICSCR, RCC_ICSCR_LSITRIMEN) == (RCC_ICSCR_LSITRIMEN)) ? 1UL : 0UL);
}

/**
  * @brief  Set LSI trimming value
  * @note After enabling the LSI oscillator and the LSI trimming procedure
  *       the LSI trimming value is decreased from 15 to 0, till LSITRIMOK raised
  * @rmtoll CSSWCR        LSISWBW       LL_RCC_LSI_SetTrimming
  * @param  Value Between Min_Data = 0 and Max_Data = 15
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSI_SetTrimming(uint32_t Value)
{
  MODIFY_REG(RCC->CSSWCR, RCC_CSSWCR_LSISWBW, Value << RCC_CSSWCR_LSISWBW_Pos);
  SET_BIT(RCC->CSSWCR, RCC_CSSWCR_LSISWTRIMEN);
}

/**
  * @brief  Get LSI trimming value
  * @rmtoll CSSWCR/ICSCR        LSITRIM       LL_RCC_LSI_GetTrimming
  * @retval Between Min_Data = 0 and Max_Data = 15
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_GetTrimming(void)
{
  if (READ_BIT(RCC->CSSWCR, RCC_CSSWCR_LSISWTRIMEN))
  {
    return (uint32_t)(READ_BIT(RCC->CSSWCR, RCC_CSSWCR_LSISWBW) >> RCC_CSSWCR_LSISWBW_Pos);
  }
  else
  {
    return (uint32_t)(READ_BIT(RCC->ICSCR, RCC_ICSCR_LSIBW) >> RCC_ICSCR_LSIBW_Pos);
  }
}

#if defined(RCC_ICSCR_LSITRIMOK)
/**
  * @brief  Check if LSI oscillator trimming is OK
  * @rmtoll ICSCR         LSITRIMOK        LL_RCC_LSI_IsTrimmed
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSI_IsTrimmed(void)
{
  return ((READ_BIT(RCC->ICSCR, RCC_ICSCR_LSITRIMOK) == (RCC_ICSCR_LSITRIMOK)) ? 1UL : 0UL);
}
#endif

/**
  * @}
  */


