stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_rcc.h
/** @defgroup RCC_LL_EF_System System Clock
  * @{
  */

/**
  * @brief  Configure the system clock source
  * @rmtoll CR         HSEON            LL_RCC_SetSysClkSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SYS_HSI
  *         @arg @ref LL_RCC_SYS_HSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSysClkSource(uint32_t Source)
{
  if (Source == LL_RCC_SYS_HSI)
  {
    CLEAR_BIT(RCC->CR, RCC_CR_HSEON);
  }
  if (Source == LL_RCC_SYS_HSE)
  {
    SET_BIT(RCC->CR, RCC_CR_HSEON);
  }
}

/**
  * @brief  Get the system clock source
  * @rmtoll CR       HSEON      LL_RCC_GetSysClkSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SYS_HSI
  *         @arg @ref LL_RCC_SYS_HSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetSysClkSource(void)
{
  if (READ_BIT(RCC->CR, RCC_CR_HSEON))
  {
    return LL_RCC_SYS_HSE;
  }

  return LL_RCC_SYS_HSI;
}

#if defined(RCC_APB2ENR_CLKBLEDIV)
/**
  * @brief  Set the RF clock frequency
  * @rmtoll APB2ENR         CLKBLEDIV          LL_RCC_SetRFClockSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RF_CLK_16M
  *         @arg @ref LL_RCC_RF_CLK_32M
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRFClock(uint32_t Source)
{
  MODIFY_REG(RCC->APB2ENR, RCC_APB2ENR_CLKBLEDIV, Source);
}

/**
  * @brief  Get the RF clock frequency
  * @rmtoll APB2ENR         CLKBLEDIV          LL_RCC_GetRFClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RF_CLK_16M
  *         @arg @ref LL_RCC_RF_CLK_32M
  */
__STATIC_INLINE uint32_t LL_RCC_GetRFClock(void)
{
  return (uint32_t)(READ_BIT(RCC->APB2ENR, RCC_APB2ENR_CLKBLEDIV));
}
#endif

#if defined(RCC_APB2RSTR_MRBLERST)
/**
    * @brief  Check if Radio System is reset.
    * @rmtoll APB2RSTR    MRBLERST    LL_RCC_IsRFUnderReset
    * @retval State of bit (1 or 0).
    */
__STATIC_INLINE uint32_t LL_RCC_IsRFUnderReset(void)
{
  return ((READ_BIT(RCC->APB2RSTR, RCC_APB2RSTR_MRBLERST) == (RCC_APB2RSTR_MRBLERST)) ? 1UL : 0UL);
}
#endif
/**
  * @}
  */

/** @defgroup RCC_LL_EF_SMPS SMPS
  * @{
  */

/**
  * @brief  Set SMPS prescaler
  * @rmtoll CFGR         SMPSDIV          LL_RCC_SetSMPSPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SMPS_DIV_2
  *         @arg @ref LL_RCC_SMPS_DIV_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSMPSPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_SMPSDIV, Prescaler);
}

/**
  * @brief  Get SMPS prescaler
  * @rmtoll CFGR         SMPSDIV          LL_RCC_GetSMPSPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SMPS_DIV_2
  *         @arg @ref LL_RCC_SMPS_DIV_4
  */
__STATIC_INLINE uint32_t LL_RCC_GetSMPSPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_SMPSDIV));
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_KRMR KRMR
  * @{
  *
  */

/**
  * @brief  Enable KRM
  * @rmtoll KRMR           KRM_EN         LL_RCC_KRM_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_KRM_Enable(void)
{
  SET_BIT(RCC->KRMR, RCC_KRMR_KRM_EN);
}

/**
  * @brief  Disable KRM
  * @rmtoll KRMR           KRM_EN         LL_RCC_HSE_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_KRM_Disable(void)
{
  CLEAR_BIT(RCC->KRMR, RCC_KRMR_KRM_EN);
}

/**
  * @brief  Check if KRM is enabled.
  * @rmtoll KRMR         KRM_EN        LL_RCC_HSE_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_KRM_IsEnabled(void)
{
  return ((READ_BIT(RCC->KRMR, RCC_KRMR_KRM_EN) == (RCC_KRMR_KRM_EN)) ? 1UL : 0UL);
}

/**
  * @brief  Set KRM rate multiplier for SMPS clock
  * @rmtoll KRMR        KRM       LL_RCC_KRM_SetRateMultiplier
  * @param  Value Between Min_Data = 0 and Max_Data = 16
  *
  * @retval None
  */
__STATIC_INLINE void LL_RCC_KRM_SetRateMultiplier(uint32_t Value)
{
  MODIFY_REG(RCC->KRMR, RCC_KRMR_KRM, Value << RCC_KRMR_KRM_Pos);
}

/**
  * @brief  Get KRM rate multiplier for SMPS clock
  * @rmtoll KRMR        KRM       LL_RCC_KRM_GetRateMultiplier
  *
  * @retval Between Min_Data = 0 and Max_Data = 16
  */
__STATIC_INLINE uint32_t LL_RCC_KRM_GetRateMultiplier(void)
{
  return (uint32_t)(READ_BIT(RCC->KRMR, RCC_KRMR_KRM) >> RCC_KRMR_KRM_Pos);
}

/**
  * @}
  */


#if defined(RCC_CFGR_LPUCLKSEL)
/** @defgroup RCC_LL_CFGR_LPUCLK_SEL LPUART Clock Selection
  * @{
  */

/**
  * @brief  Set LPUART Clock source
  * @rmtoll CFGR         LPUCLKSEL          LL_RCC_SetLPUARTClockSource
  * @param  Source this parameter can be one of the following values:
  *         @arg @ref LL_RCC_LPUCLKSEL_CLK16M
  *         @arg @ref LL_RCC_LPUCLKSEL_CLKLSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetLPUARTClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_LPUCLKSEL, Source);
}

/**
  * @brief  Get LPUART Clock source
  * @rmtoll CFGR         LPUCLKSEL          LL_RCC_GetLPUARTClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_LPUCLKSEL_CLK16M
  *         @arg @ref LL_RCC_LPUCLKSEL_CLKLSE
  */
__STATIC_INLINE uint32_t LL_RCC_GetLPUARTClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_LPUCLKSEL));
}

/**
  * @}
  */
#endif /* RCC_CFGR_LPUCLKSEL */

/** @defgroup RCC_LL_EF_MCO_LSCO MCO/LSCO configuration
  * @{
  */

/**
  * @brief  Configure MCOx
  * @rmtoll CFGR         MCOSEL        LL_RCC_ConfigMCO\n
  *         CFGR         CCOPRE        LL_RCC_ConfigMCO
  * @param  MCOSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCOSOURCE_NOCLOCK
  *         @arg @ref LL_RCC_MCOSOURCE_SYSCLK
  *         @arg @ref LL_RCC_MCOSOURCE_HSI
  *         @arg @ref LL_RCC_MCOSOURCE_RC64MPLL
  *         @arg @ref LL_RCC_MCOSOURCE_HSE
  *         @arg @ref LL_RCC_MCOSOURCE_HSI64M_DIV2048
  *         @arg @ref LL_RCC_MCOSOURCE_SMPS
  *         @arg @ref LL_RCC_MCOSOURCE_ADC
  * @param  MCOPrescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_MCO_DIV_1
  *         @arg @ref LL_RCC_MCO_DIV_2
  *         @arg @ref LL_RCC_MCO_DIV_4
  *         @arg @ref LL_RCC_MCO_DIV_8
  *         @arg @ref LL_RCC_MCO_DIV_16
  *         @arg @ref LL_RCC_MCO_DIV_32
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ConfigMCO(uint32_t MCOSource, uint32_t MCOPrescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_MCOSEL | RCC_CFGR_CCOPRE, MCOSource | MCOPrescaler);
}

/**
  * @brief  Configure LSCOx
  * @rmtoll CFGR         LCOSEL        LL_RCC_ConfigLSCO
  * @param  LSCOSource This parameter can be one of the following values:
  *         @arg @ref LL_RCC_LSCOSOURCE_NOCLOCK
  *         @arg @ref LL_RCC_LSCOSOURCE_LSI
  *         @arg @ref LL_RCC_LSCOSOURCE_LSE
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ConfigLSCO(uint32_t LSCOSource)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_LCOSEL, LSCOSource);
}

#if defined(RCC_CFGR_LCOEN)
/**
  * @brief  LCO enabled on GPIA_Pin_10 also in deepstop
  * @rmtoll CFGR         LCOEN        LL_RCC_LSCOinDeepStop_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSCOinDeepStop_Enable(void)
{
  SET_BIT(RCC->CFGR, RCC_CFGR_LCOEN);
}

/**
  * @brief  LCO disabled on GPIA_Pin_10 also in deepstop
  * @rmtoll CFGR         LCOEN        LL_RCC_LSCOinDeepStop_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_LSCOinDeepStop_Disable(void)
{
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_LCOEN);
}

/**
  * @brief  Check if the LCO is enabled on PA10 in deepstop
  * @rmtoll CFGR         LCOEN        LL_RCC_LSCOinDeepStop_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_LSCOinDeepStop_IsEnabled(void)
{
  return ((READ_BIT(RCC->CFGR, RCC_CFGR_LCOEN) == (RCC_CFGR_LCOEN)) ? 1UL : 0UL);
}

/**
  * @}
  */
#endif

#if defined( RCC_CFGR_IOBOOSTEN)
/** @defgroup RCC_LL_EF_IOBOOST IOBOOSTER configuration
  * @{
  */
/**
  * @brief  IO BOOSTER enable
  * @rmtoll CFGR         IOBOOSTEN        LL_RCC_IOBOOST_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IOBOOST_Enable(void)
{
  SET_BIT(RCC->CFGR, RCC_CFGR_IOBOOSTEN);
}

/**
  * @brief  IO BOOSTER disable
  * @rmtoll CFGR         IOBOOSTEN        LL_RCC_IOBOOST_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_IOBOOST_Disable(void)
{
  CLEAR_BIT(RCC->CFGR, RCC_CFGR_IOBOOSTEN);
}

/**
  * @brief  Check if the IO BOOSTER is enabled
  * @rmtoll CFGR         IOBOOSTEN        LL_RCC_IOBOOST_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IOBOOST_IsEnabled(void)
{
  return ((READ_BIT(RCC->CFGR, RCC_CFGR_IOBOOSTEN) == (RCC_CFGR_IOBOOSTEN)) ? 1UL : 0UL);
}

/**
  * @}
  */
#endif

/** @defgroup RCC_LL_EF_Peripheral_Clock_Source Peripheral Clock Source
  * @{
  */

/**
  * @brief  Configure SPI3I2S  clock source
  * @rmtoll CFGR        SPI3I2SCLKSEL      LL_RCC_SetSPI3I2SClockSource
  * @param  Source This parameter can be one of the following values:
  *         @arg @ref LL_RCC_SPI3_I2S_CLKSOURCE_CLK_ROOT_DIV
  *         @arg @ref LL_RCC_SPI3_I2S_CLKSOURCE_CLK_ROOT
  *         @arg @ref LL_RCC_SPI3_I2S_CLKSOURCE_CLK_RC64MPLL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetSPI3I2SClockSource(uint32_t Source)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_SPI3I2SCLKSEL, Source);
}

/**
  * @brief  Get SPI3I2S clock source
  * @rmtoll CFGR        SPI3I2SCLKSEL    LL_RCC_GetSPI3I2SClockSource
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_SPI3_I2S_CLKSOURCE_CLK_ROOT_DIV
  *         @arg @ref LL_RCC_SPI3_I2S_CLKSOURCE_CLK_ROOT
  *         @arg @ref LL_RCC_SPI3_I2S_CLKSOURCE_CLK_RC64MPLL
  */
__STATIC_INLINE uint32_t LL_RCC_GetSPI3I2SClockSource(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_SPI3I2SCLKSEL));
}

/**
  * @}
  */

