stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_rcc.h
/** @defgroup RCC_LL_EF_RTC RTC
  * @{
  */

/**
  * @brief  Enable RTC
  * @rmtoll APB0ENR         RTCEN         LL_RCC_EnableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableRTC(void)
{
  SET_BIT(RCC->APB0ENR, RCC_APB0ENR_RTCEN);
}

/**
  * @brief  Disable RTC
  * @rmtoll APB0ENR         RTCEN         LL_RCC_DisableRTC
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableRTC(void)
{
  CLEAR_BIT(RCC->APB0ENR, RCC_APB0ENR_RTCEN);
}

/**
  * @brief  Check if RTC has been enabled or not
  * @rmtoll APB0ENR         RTCEN         LL_RCC_IsEnabledRTC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledRTC(void)
{
  return ((READ_BIT(RCC->APB0ENR, RCC_APB0ENR_RTCEN) == (RCC_APB0ENR_RTCEN)) ? 1UL : 0UL);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_PLL PLL
  * @{
  */

/**
  * @brief  Enable RC64MPLL
  * @rmtoll CR           HSIPLLON         LL_RCC_RC64MPLL_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RC64MPLL_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSIPLLON);
}

/**
  * @brief  Disable RC64MPLL
  * @note Cannot be disabled if the RC64MPLL clock is used as the system clock
  * @rmtoll CR           HSIPLLON         LL_RCC_RC64MPLL_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RC64MPLL_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSIPLLON);
}

/**
  * @brief  Check if RC64MPLL is Ready
  * @rmtoll CR           HSIPLLRDY        LL_RCC_RC64MPLL_IsReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_RC64MPLL_IsReady(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSIPLLRDY) == (RCC_CR_HSIPLLRDY)) ? 1UL : 0UL);
}

/**
  * @brief  Set RC64MPLL prescaler
  * @rmtoll CFGR       CLKSYSDIV          LL_RCC_SetRC64MPLLPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RC64MPLL_DIV_1
  *         @arg @ref LL_RCC_RC64MPLL_DIV_2
  *         @arg @ref LL_RCC_RC64MPLL_DIV_4
  *         @arg @ref LL_RCC_RC64MPLL_DIV_8
  *         @arg @ref LL_RCC_RC64MPLL_DIV_16
  *         @arg @ref LL_RCC_RC64MPLL_DIV_32
  *         @arg @ref LL_RCC_RC64MPLL_DIV_64
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetRC64MPLLPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_CLKSYSDIV, Prescaler);
}

/**
  * @brief  Get RC64MPLL prescaler
  * @rmtoll CFGR         CLKSYSDIV     LL_RCC_GetRC64MPLLPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RC64MPLL_DIV_1
  *         @arg @ref LL_RCC_RC64MPLL_DIV_2
  *         @arg @ref LL_RCC_RC64MPLL_DIV_4
  *         @arg @ref LL_RCC_RC64MPLL_DIV_8
  *         @arg @ref LL_RCC_RC64MPLL_DIV_16
  *         @arg @ref LL_RCC_RC64MPLL_DIV_32
  *         @arg @ref LL_RCC_RC64MPLL_DIV_64
  */
__STATIC_INLINE uint32_t LL_RCC_GetRC64MPLLPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_CLKSYSDIV));
}

#if defined(RCC_CFGR_CLKSYSDIV_STATUS)
/**
  * @brief  Get System Clock Prescaler Status
  * @rmtoll CFGR         CLKSYSDIV_STATUS     LL_RCC_GetCLKSYSPrescalerStatus
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_RC64MPLL_DIV_1
  *         @arg @ref LL_RCC_RC64MPLL_DIV_2
  *         @arg @ref LL_RCC_RC64MPLL_DIV_4
  *         @arg @ref LL_RCC_RC64MPLL_DIV_8
  *         @arg @ref LL_RCC_RC64MPLL_DIV_16
  *         @arg @ref LL_RCC_RC64MPLL_DIV_32
  *         @arg @ref LL_RCC_RC64MPLL_DIV_64
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_1
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_2
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_3
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_6
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_12
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_48
  */
__STATIC_INLINE uint32_t LL_RCC_GetCLKSYSPrescalerStatus(void)
{
  return (uint32_t)((READ_BIT(RCC->CFGR, RCC_CFGR_CLKSYSDIV_STATUS) >> RCC_CFGR_CLKSYSDIV_STATUS_Pos) << RCC_CFGR_CLKSYSDIV_Pos);
}
#endif

/**
  * @brief  Set DIRECT_HSE prescaler
  * @rmtoll CFGR       CLKSYSDIV          LL_RCC_SetDirectHSEPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_1
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_2
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_3
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_6
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_12
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_48
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SetDirectHSEPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CFGR, RCC_CFGR_CLKSYSDIV, Prescaler);
}

/**
  * @brief  Get DIRECT_HSE prescaler
  * @rmtoll CFGR         CLKSYSDIV     LL_RCC_GetDirectHSEPrescaler
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_1
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_2
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_3
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_6
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_12
  *         @arg @ref LL_RCC_DIRECT_HSE_DIV_48
  */
__STATIC_INLINE uint32_t LL_RCC_GetDirectHSEPrescaler(void)
{
  return (uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_CLKSYSDIV));
}
/**
  * @}
  */

/** @defgroup RCC_LL_EF_FLAG_Management FLAG Management
  * @{
  */

/**
  * @brief  Clear LSI ready interrupt flag
  * @rmtoll CIFR         LSIRDYF       LL_RCC_ClearFlag_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSIRDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_LSIRDYF);
}

/**
  * @brief  Clear LSE ready interrupt flag
  * @rmtoll CIFR         LSERDYF       LL_RCC_ClearFlag_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LSERDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_LSERDYF);
}

/**
  * @brief  Clear HSI ready interrupt flag
  * @rmtoll CIFR         HSIRDYF       LL_RCC_ClearFlag_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSIRDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_HSIRDYF);
}

/**
  * @brief  Clear HSE ready interrupt flag
  * @rmtoll CIFR         HSERDYF       LL_RCC_ClearFlag_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_HSERDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_HSERDYF);
}

/**
  * @brief  Clear RC64MPLL ready interrupt flag
  * @rmtoll CIFR         HSIPLLRDYF       LL_RCC_ClearFlag_RC64MPLLRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_RC64MPLLRDY(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_HSIPLLRDYF);
}

/**
  * @brief  Clear RC64MPLL Unlock Detection interrupt flag
  * @rmtoll CIFR         HSIPLLUNLOCKDETF       LL_RCC_ClearFlag_RC64MPLLUNLOCKDET
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_RC64MPLLUNLOCKDET(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_HSIPLLUNLOCKDETF);
}

/**
  * @brief  Clear RTC Reset Release interrupt flag
  * @rmtoll CIFR         RTCRSTF       LL_RCC_ClearFlag_RTCRRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_RTCRSTREL(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_RTCRSTF);
}

/**
  * @brief  Clear Watchdog Reset Release interrupt flag
  * @rmtoll CIFR         WDGRSTF       LL_RCC_ClearFlag_WDGRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_WDGRSTREL(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_WDGRSTF);
}

#if defined(RCC_CIFR_LPURSTF)
/**
  * @brief  Clear LPUART Reset Release interrupt flag
  * @rmtoll CIFR         LPURSTF       LL_RCC_ClearFlag_LPURSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LPURSTREL(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_LPURSTF);
}
#endif

