stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_rcc.h
#if defined(RCC_CIFR_LCDRSTF)
/**
  * @brief  Clear LCD Reset Release interrupt flag
  * @rmtoll CIFR         LCDRSTF       LL_RCC_ClearFlag_LCDRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LCDRSTREL(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_LCDRSTF);
}
#endif

#if defined(RCC_CIFR_LCSCRSTF)
/**
  * @brief  Clear LCSC Reset Release interrupt flag
  * @rmtoll CIFR         LCSCRSTF       LL_RCC_ClearFlag_LCSCRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_LCSCRSTREL(void)
{
  WRITE_REG(RCC->CIFR, RCC_CIFR_LCSCRSTF);
}
#endif

/**
  * @brief  Check if LSI ready interrupt occurred or not
  * @rmtoll CIFR         LSIRDYF       LL_RCC_IsActiveFlag_LSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSIRDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_LSIRDYF) == (RCC_CIFR_LSIRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if LSE ready interrupt occurred or not
  * @rmtoll CIFR         LSERDYF       LL_RCC_IsActiveFlag_LSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LSERDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_LSERDYF) == (RCC_CIFR_LSERDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSI ready interrupt occurred or not
  * @rmtoll CIFR         HSIRDYF       LL_RCC_IsActiveFlag_HSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSIRDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_HSIRDYF) == (RCC_CIFR_HSIRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if HSE ready interrupt occurred or not
  * @rmtoll CIFR         HSERDYF       LL_RCC_IsActiveFlag_HSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_HSERDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_HSERDYF) == (RCC_CIFR_HSERDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RC64MPLL ready interrupt occurred or not
  * @rmtoll CIFR         HSIPLLRDYF       LL_RCC_IsActiveFlag_RC64MPLLRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_RC64MPLLRDY(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_HSIPLLRDYF) == (RCC_CIFR_HSIPLLRDYF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RC64MPLL Unlock Detection flag interrupt occurred or not
  * @rmtoll CIFR         HSIPLLUNLOCKDETF       LL_RCC_IsActiveFlag_RC64MPLLUNLOCKDET
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_RC64MPLLUNLOCKDET(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_HSIPLLUNLOCKDETF) == (RCC_CIFR_HSIPLLUNLOCKDETF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RTC Reset Release flag interrupt occurred or not
  * @rmtoll CIFR         RTCRSTF       LL_RCC_IsActiveFlag_RTCRSTREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_RTCRSTREL(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_RTCRSTF) == (RCC_CIFR_RTCRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if WDG Reset Release flag interrupt occurred or not
  * @rmtoll CIFR         WDGRSTF       LL_RCC_IsActiveFlag_WDGRSTREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_WDGRSTREL(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_WDGRSTF) == (RCC_CIFR_WDGRSTF)) ? 1UL : 0UL);
}

#if defined(RCC_CIFR_LPURSTF)
/**
  * @brief  Check if LPUART Reset Release flag interrupt occurred or not
  * @rmtoll CIFR         LPURSTF       LL_RCC_IsActiveFlag_LPURSTREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LPURSTREL(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_LPURSTF) == (RCC_CIFR_LPURSTF)) ? 1UL : 0UL);
}
#endif

#if defined(RCC_CIFR_LCDRSTF)
/**
  * @brief  Check if LCD Reset Release flag interrupt occurred or not
  * @rmtoll CIFR         LCDRSTF       LL_RCC_IsActiveFlag_LCDRSTREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LCDRSTREL(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_LCDRSTF) == (RCC_CIFR_LCDRSTF)) ? 1UL : 0UL);
}
#endif

#if defined(RCC_CIFR_LCSCRSTF)
/**
  * @brief  Check if LCSC Reset Release flag interrupt occurred or not
  * @rmtoll CIFR         LCSCRSTF       LL_RCC_IsActiveFlag_LCSCRSTREL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LCSCRSTREL(void)
{
  return ((READ_BIT(RCC->CIFR, RCC_CIFR_LCSCRSTF) == (RCC_CIFR_LCSCRSTF)) ? 1UL : 0UL);
}
#endif

/**
  * @brief  Check if RCC flag CPU lockup reset is set or not.
  * @rmtoll CSR          LOCKUPRSTF      LL_RCC_IsActiveFlag_LOCKUPRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_LOCKUPRST(void)
{
  return ((READ_BIT(RCC->CSR, RCC_CSR_LOCKUPRSTF) == (RCC_CSR_LOCKUPRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Watchdog reset is set or not.
  * @rmtoll CSR          WDGRSTF      LL_RCC_IsActiveFlag_WDGRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_WDGRST(void)
{
  return ((READ_BIT(RCC->CSR, RCC_CSR_WDGRSTF) == (RCC_CSR_WDGRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Software reset is set or not.
  * @rmtoll CSR          SFTRSTF      LL_RCC_IsActiveFlag_SFTRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_SFTRST(void)
{
  return ((READ_BIT(RCC->CSR, RCC_CSR_SFTRSTF) == (RCC_CSR_SFTRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag Power-On reset is set or not.
  * @rmtoll CSR          PORRSTF      LL_RCC_IsActiveFlag_PORRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PORRST(void)
{
  return ((READ_BIT(RCC->CSR, RCC_CSR_PORRSTF) == (RCC_CSR_PORRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Check if RCC flag NRSTn pad reset is set or not.
  * @rmtoll CSR          PADRSTF      LL_RCC_IsActiveFlag_PADRST
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_PADRST(void)
{
  return ((READ_BIT(RCC->CSR, RCC_CSR_PADRSTF) == (RCC_CSR_PADRSTF)) ? 1UL : 0UL);
}

/**
  * @brief  Set RMVF bit to clear the reset flags.
  * @rmtoll CSR          RMVF          LL_RCC_ClearResetFlags
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearResetFlags(void)
{
  WRITE_REG(RCC->CSR, RCC_CSR_RMVF);
}

/**
  * @}
  */

/** @defgroup RCC_LL_EF_CLK_SWITCH_Management Clock Switch Management
  * @{
  */

/**
  * @brief  Set RC64MPLL prescaler to switch the clock when the MR_BLE or MR_SUBG or LPAWUR is enabled
  * @rmtoll CSCMDR       CLKSYSDIV_REQ          LL_RCC_SwitchRC64MPLLPrescaler
  * @param  Prescaler This parameter can be one of the following values:
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_DIV_1
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_DIV_2
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_DIV_4
  * @retval None
  */
__STATIC_INLINE void LL_RCC_SwitchRC64MPLLPrescaler(uint32_t Prescaler)
{
  MODIFY_REG(RCC->CSCMDR, RCC_CSCMDR_CLKSYSDIV_REQ, Prescaler);
}

/**
  * @brief  Request the RC64MPLL prescaler to switch the clock when the MR_BLE is enabled
  * @rmtoll CSCMDR       REQUEST          LL_RCC_RequestSwitchRC64MPLLClock
  * @retval None
  */
__STATIC_INLINE void LL_RCC_RequestSwitchRC64MPLLClock(void)
{
  SET_BIT(RCC->CSCMDR, RCC_CSCMDR_REQUEST);
}

/**
  * @brief  Get RC64MPLL clock switch status
  * @rmtoll CSCMDR        STATUS      LL_RCC_HSE_GetCapacitorTuning
  * @retval The Clock switch status. Possible values are:
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_STATUS_IDLE
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_STATUS_ONGOING
  *         @arg @ref LL_RCC_RC64MPLL_SWITCH_STATUS_DONE
  */
__STATIC_INLINE uint32_t LL_RCC_GetRC64MPLLSwitchStatus(void)
{
  return (uint32_t)(READ_BIT(RCC->CSCMDR, RCC_CSCMDR_STATUS));
}

/**
  * @brief  Enable End of Switch Sequence interrupt
  * @rmtoll CSCMDR         EOFSEQ_IE      LL_RCC_EnableIT_EOFSEQ
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_EOFSEQ(void)
{
  SET_BIT(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IE);
}

/**
  * @brief  Disable End of Switch Sequence interrupt
  * @rmtoll CSCMDR         EOFSEQ_IE      LL_RCC_DisableIT_EOFSEQ
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_EOFSEQ(void)
{
  CLEAR_BIT(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IE);
}

/**
  * @brief  Checks if End of Switch Sequence interrupt source is enabled or disabled.
  * @rmtoll CSCMDR         EOFSEQ_IE      LL_RCC_IsEnabledIT_EOFSEQ
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_EOFSEQ(void)
{
  return ((READ_BIT(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IE) == (RCC_CSCMDR_EOFSEQ_IE)) ? 1UL : 0UL);
}

/**
  * @brief  Clear End of Sequence interrupt flag
  * @rmtoll CSCMDR         EOFSEQ_IRQ       LL_RCC_ClearFlag_EOFSEQ
  * @retval None
  */
__STATIC_INLINE void LL_RCC_ClearFlag_EOFSEQ(void)
{
  WRITE_REG(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IRQ);
}

/**
  * @brief  Check if End of Sequence interrupt occurred or not
  * @rmtoll CSCMDR         EOFSEQ_IRQ       LL_RCC_IsActiveFlag_EOFSEQ
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsActiveFlag_EOFSEQ(void)
{
  return ((READ_BIT(RCC->CSCMDR, RCC_CSCMDR_EOFSEQ_IRQ) == (RCC_CSCMDR_EOFSEQ_IRQ)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup RCC_LL_EF_IT_Management IT Management
  * @{
  */

/**
  * @brief  Enable LSI ready interrupt
  * @rmtoll CIER         LSIRDYIE      LL_RCC_EnableIT_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSIRDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_LSIRDYIE);
}

/**
  * @brief  Enable LSE ready interrupt
  * @rmtoll CIER         LSERDYIE      LL_RCC_EnableIT_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LSERDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_LSERDYIE);
}

/**
  * @brief  Enable HSI ready interrupt
  * @rmtoll CIER         HSIRDYIE      LL_RCC_EnableIT_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSIRDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_HSIRDYIE);
}

/**
  * @brief  Enable HSE ready interrupt
  * @rmtoll CIER         HSERDYIE      LL_RCC_EnableIT_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_HSERDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_HSERDYIE);
}

/**
  * @brief  Enable RC64MPLL ready interrupt
  * @rmtoll CIER         HSIPLLRDYIE      LL_RCC_EnableIT_RC64MPLLRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_RC64MPLLRDY(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_HSIPLLRDYIE);
}

/**
  * @brief  Enable RC64MPLL Unlock Detection interrupt
  * @rmtoll CIER         RCC_CIER_HSIPLLUNLOCKDETIE      LL_RCC_EnableIT_RC64MPLLUNLOCKDET
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_RC64MPLLUNLOCKDET(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_HSIPLLUNLOCKDETIE);
}

/**
  * @brief  Enable RTC Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_RTCRSTIE      LL_RCC_EnableIT_RTCRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_RTCRSTREL(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_RTCRSTIE);
}

/**
  * @brief  Enable Watchdog Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_WDGRSTIE      LL_RCC_EnableIT_WDGRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_WDGRSTREL(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_WDGRSTIE);
}

#if defined(RCC_CIER_LPURSTIE)
/**
  * @brief  Enable LPUART Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_LPURSTIE      LL_RCC_EnableIT_LPURSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LPURSTREL(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_LPURSTIE);
}
#endif

