stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_rcc.h
#if defined(RCC_CIER_LCDRSTIE)
/**
  * @brief  Enable LCD Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_LCDRSTIE      LL_RCC_EnableIT_LCDRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LCDRSTREL(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_LCDRSTIE);
}
#endif

#if defined(RCC_CIER_LCSCRSTIE)
/**
  * @brief  Enable LCSC Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_LCSCRSTIE      LL_RCC_EnableIT_LCSCRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_EnableIT_LCSCRSTREL(void)
{
  SET_BIT(RCC->CIER, RCC_CIER_LCSCRSTIE);
}
#endif

/**
  * @brief  Disable LSI ready interrupt
  * @rmtoll CIER         LSIRDYIE      LL_RCC_DisableIT_LSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSIRDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_LSIRDYIE);
}

/**
  * @brief  Disable LSE ready interrupt
  * @rmtoll CIER         LSERDYIE      LL_RCC_DisableIT_LSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LSERDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_LSERDYIE);
}

/**
  * @brief  Disable HSI ready interrupt
  * @rmtoll CIER         HSIRDYIE      LL_RCC_DisableIT_HSIRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSIRDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_HSIRDYIE);
}

/**
  * @brief  Disable HSE ready interrupt
  * @rmtoll CIER         HSERDYIE      LL_RCC_DisableIT_HSERDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_HSERDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_HSERDYIE);
}

/**
  * @brief  Disable RC64MPLL ready interrupt
  * @rmtoll CIER         HSIPLLRDYIE      LL_RCC_DisableIT_RC64MPLLRDY
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_RC64MPLLRDY(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_HSIPLLRDYIE);
}

/**
  * @brief  Disable RC64MPLL Unlock Detection interrupt
  * @rmtoll CIER         RCC_CIER_HSIPLLUNLOCKDETIE      LL_RCC_DisableIT_RC64MPLLUNLOCKDET
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_RC64MPLLUNLOCKDET(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_HSIPLLUNLOCKDETIE);
}

/**
  * @brief  Disable RTC Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_RTCRSTIE      LL_RCC_DisableIT_RTCRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_RTCRSTREL(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_RTCRSTIE);
}

/**
  * @brief  Disable Watchdog Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_WDGRSTIE      LL_RCC_DisableIT_WDGRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_WDGRSTREL(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_WDGRSTIE);
}

#if defined(RCC_CIER_LPURSTIE)
/**
  * @brief  Disable LPUART Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_LPURSTIE      LL_RCC_DisableIT_LPURSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LPURSTREL(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_LPURSTIE);
}
#endif

#if defined(RCC_CIER_LCDRSTIE)
/**
  * @brief  Disable LCD Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_LCDRSTIE      LL_RCC_DisableIT_LCDRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LCDRSTREL(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_LCDRSTIE);
}
#endif

#if defined(RCC_CIER_LCSCRSTIE)
/**
  * @brief  Disable LCSC Reset Release interrupt
  * @rmtoll CIER         RCC_CIER_LCSCRSTIE      LL_RCC_DisableIT_LCSCRSTREL
  * @retval None
  */
__STATIC_INLINE void LL_RCC_DisableIT_LCSCRSTREL(void)
{
  CLEAR_BIT(RCC->CIER, RCC_CIER_LCSCRSTIE);
}
#endif

/**
  * @brief  Checks if LSI ready interrupt source is enabled or disabled.
  * @rmtoll CIER         LSIRDYIE      LL_RCC_IsEnabledIT_LSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSIRDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_LSIRDYIE) == (RCC_CIER_LSIRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if LSE ready interrupt source is enabled or disabled.
  * @rmtoll CIER         LSERDYIE      LL_RCC_IsEnabledIT_LSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LSERDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_LSERDYIE) == (RCC_CIER_LSERDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if HSI ready interrupt source is enabled or disabled.
  * @rmtoll CIER         HSIRDYIE      LL_RCC_IsEnabledIT_HSIRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSIRDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_HSIRDYIE) == (RCC_CIER_HSIRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if HSE ready interrupt source is enabled or disabled.
  * @rmtoll CIER         HSERDYIE      LL_RCC_IsEnabledIT_HSERDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_HSERDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_HSERDYIE) == (RCC_CIER_HSERDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if RC64MPLL ready interrupt source is enabled or disabled.
  * @rmtoll CIER         HSIPLLRDYIE      LL_RCC_IsEnabledIT_RC64MPLLRDY
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_RC64MPLLRDY(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_HSIPLLRDYIE) == (RCC_CIER_HSIPLLRDYIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if RC64MPLL Unlock Detection interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_HSIPLLUNLOCKDETIE      LL_RCC_IsEnabledIT_RC64MPLLUNLOCKDET
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_RC64MPLLUNLOCKDET(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_HSIPLLUNLOCKDETIE) == (RCC_CIER_HSIPLLUNLOCKDETIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if RTC Reset Release interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_RTCRSTIE      LL_RCC_IsEnabledIT_RTCRSTREL
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_RTCRSTREL(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_RTCRSTIE) == (RCC_CIER_RTCRSTIE)) ? 1UL : 0UL);
}

/**
  * @brief  Checks if Watchdog Reset Release interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_WDGRSTIE      LL_RCC_IsEnabledIT_WDGRSTREL
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_WDGRSTREL(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_WDGRSTIE) == (RCC_CIER_WDGRSTIE)) ? 1UL : 0UL);
}

#if defined(RCC_CIER_LPURSTIE)
/**
  * @brief  Checks if LPUART Reset Release interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_LPURSTIE      LL_RCC_IsEnabledIT_LPURSTREL
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LPURSTREL(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_LPURSTIE) == (RCC_CIER_LPURSTIE)) ? 1UL : 0UL);
}
#endif

