stm32duino/Arduino_Core_STM32/system/Drivers/STM32WL3x_HAL_Driver/Inc/stm32wl3x_ll_rcc.h
#if defined(RCC_CIER_LCDRSTIE)
/**
  * @brief  Checks if LCD Reset Release interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_LCDRSTIE      LL_RCC_IsEnabledIT_LCDRSTREL
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LCDRSTREL(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_LCDRSTIE) == (RCC_CIER_LCDRSTIE)) ? 1UL : 0UL);
}
#endif

#if defined(RCC_CIER_LCSCRSTIE)
/**
  * @brief  Checks if LCSC Reset Release interrupt source is enabled or disabled.
  * @rmtoll CIER         RCC_CIER_LCSCRSTIE      LL_RCC_IsEnabledIT_LCSCRSTREL
  * @retval None
  */
__STATIC_INLINE uint32_t LL_RCC_IsEnabledIT_LCSCRSTREL(void)
{
  return ((READ_BIT(RCC->CIER, RCC_CIER_LCSCRSTIE) == (RCC_CIER_LCSCRSTIE)) ? 1UL : 0UL);
}
#endif

/**
  * @}
  */

/** @defgroup RCC_LL_HSEPLL_BUFFER_RF External high speed clock buffer for PLL RF2G4
  * @{
  */

/**
  * @brief  Enable high speed clock buffer for PLL RF2G4
  * @rmtoll CR           HSEPLLBUFON     LL_RCC_HSEPLLBUFON_Enable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEPLLBUFON_Enable(void)
{
  SET_BIT(RCC->CR, RCC_CR_HSEPLLBUFON);
}

/**
  * @brief  Disable high speed clock buffer for PLL RF2G4
  * @rmtoll CR           HSEPLLBUFON         LL_RCC_HSEPLLBUFON_Disable
  * @retval None
  */
__STATIC_INLINE void LL_RCC_HSEPLLBUFON_Disable(void)
{
  CLEAR_BIT(RCC->CR, RCC_CR_HSEPLLBUFON);
}

/**
  * @brief  Check if the high speed clock buffer for PLL RF2G4 is enabled.
  * @rmtoll CR         HSEPLLBUFON        LL_RCC_HSEPLLBUFON_IsEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_RCC_HSEPLLBUFON_IsEnabled(void)
{
  return ((READ_BIT(RCC->CR, RCC_CR_HSEPLLBUFON) == (RCC_CR_HSEPLLBUFON)) ? 1UL : 0UL);
}
/**
  * @}
  */


#if defined(USE_FULL_LL_DRIVER)
/** @defgroup RCC_LL_EF_Init De-initialization function
  * @{
  */
ErrorStatus LL_RCC_DeInit(void);
/**
  * @}
  */

/** @defgroup RCC_LL_EF_Get_Freq Get system and peripherals clocks frequency functions
  * @{
  */
void        LL_RCC_GetSystemClocksFreq(LL_RCC_ClocksTypeDef *RCC_Clocks);
uint32_t    LL_RCC_GetSMPSClockFreq(void);
#if defined(RCC_CFGR_LPUCLKSEL)
uint32_t    LL_RCC_GetLPUARTClockFreq(uint32_t LPUARTxSource);
#endif /* RCC_CFGR_LPUCLKSEL */
uint32_t    LL_RCC_GetSPIClockFreq(uint32_t SPIxSource);

/**
  * @}
  */

#endif /* USE_FULL_LL_DRIVER */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RCC) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32WL3x_LL_RCC_H */
